export const GREETING = (username: string) => `
👋 Привет, ${username}!

🎯 Добро пожаловать в бота для подготовки к собеседованиям.
📚 Здесь собраны программы обучения под разные цели — от лёгкой разминки до серьёзного хардкора.

🤖 Вопросы можно разбирать в двух форматах:

- с помощью GPT, когда нужен развернутый разбор 
- в стиле «вопрос-ответ», если хочется больше практики и меньше теории.

👉 Выбирай программу и начинай готовиться!
`;

export const SUCCESS_MSG = 'Спасибо! 😊 Мы получили твою информацию и готовы обсудить детали. Скоро свяжемся с тобой, чтобы уточнить нюансы и предложить наилучшее решение. 🚀'
export const ERROR_MSG = '😔 Ой, что-то пошло не так. Попробуй ещё раз или напиши нам, мы разберёмся!'

export const PASS_AN_INTERVIEW_TEXT = `НАЧАИНВАЕТСЯ СООБЕСЕДОВАИНЕ`;
export const LEARN_THEMES_TEXT = `<b>📖 Изучение по темам</b>\n\nВыберите категорию для изучения:`

export const MAKE_SCHEDULE_TITLE = `
<b>Что тревожит душу?</b>
 
Выбери сферу, которая волнует сильнее всего, и я расскажу, что ждёт впереди
`;